Revit 2027 API
FilteredWorksetIdIterator.Current Property
Gets the item at the current position of the iterator.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual WorksetId Current { get; }
Public Overridable ReadOnly Property Current As WorksetId
	Get
public:
virtual property WorksetId^ Current {
	WorksetId^ get ();
}
abstract Current : WorksetId with get
override Current : WorksetId with get
Property Value
WorksetId
Implements
IEnumerator<T>.Current
Exceptions
Exception | Condition
InvalidOperationException |  There is no current item in the iterator.
Remarks
There is no current item if the iterator has not started yet or has been done.
See Also
Reference
FilteredWorksetIdIterator Class
Autodesk.Revit.DB Namespace